Revit 2027 API
View.HideElementTemporary Method
 Set one element to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void HideElementTemporary(
	ElementId elementId
)
Public Sub HideElementTemporary (
	elementId As ElementId
)
public:
void HideElementTemporary(
	ElementId^ elementId
)
member HideElementTemporary :
        elementId : ElementId -> unit
Parameters
elementId ElementId
 The id of the element to be temporarily hidden.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
View Class
Autodesk.Revit.DB Namespace